app/Http/Middleware/HandleInertiaRequests.php

    public function share(Request $request): array
    {
        return [
            ...parent::share($request),
            'auth' => [
                'user' => UserData::optional($request->user()),
            ],
            'ziggy' => fn () => [
                ...(new Ziggy)->toArray(),
                'location' => $request->url(),
            ],
            'cart' => CartData::optional((new Cart)->getCart()),
            'global' => fn () => GlobalData::optional([
                'action' => session()->get('action'),
                'categories' => CategoryData::collect(Category::with('cover')->get()),
            ]),
            'flash' => fn () => [
                'success' => session()->get('success'),
                'error' => session()->get('error'),
            ],
        ];
---
SELECT * FROM `users` WHERE `id` = 1 LIMIT 1