app/Http/Controllers/CartController.php

    public function store(Request $request)
    {
        $request->validate([
            'product_id' => 'required|integer',
            'price' => 'required|numeric',
            'variation_id' => 'nullable|integer',
            'quantity' => 'required|integer|min:1',
        ]);

        $productFromDB = Product::with('variations')->findOrFail(request('product_id'));

        if ($productFromDB->stock_status == ProductStockStatus::OUT_OF_STOCK) {
            return back()->with('error', __('cart')['item_out_of_stock']);
        }

        $cart = (new \App\Support\Cart)->getOrCreateCart();

        $qty = request('quantity', 1);

        $query = $cart->products()->wherePivot('product_id', request('product_id'));

        if (request('variation_id')) {
            $query->wherePivot('product_variation_id', request('variation_id'));
        }

        $existing = $query->first();
---
SELECT * FROM `products` WHERE `products`.`id` = 16 and `products`.`deleted_at` IS NULL LIMIT 1
SELECT * FROM `variations` WHERE `variations`.`id` in (1)
SELECT `products`.*, `cart_product`.`cart_id` as `pivot_cart_id`, `cart_product`.`product_id` as `pivot_product_id`, `cart_product`.`id` as `pivot_id`, `cart_product`.`product_variation_id` as `pivot_product_variation_id`, `cart_product`.`price` as `pivot_price`, `cart_product`.`real_price` as `pivot_real_price`, `cart_product`.`quantity` as `pivot_quantity` FROM `products` inner join `cart_product` on `products`.`id` = `cart_product`.`product_id` WHERE `cart_product`.`cart_id` = 2 and `cart_product`.`product_id` = 1 and `cart_product`.`product_variation_id` = 2 and `products`.`deleted_at` IS NULL LIMIT 1

                ])
            );
        } else {
            $cart->products()->attach([
                request('product_id') => [
                    'product_variation_id' => request('variation_id'),
                    'price' => request('price'),
                    'real_price' => request('real_price') > 0 ? request('real_price') : null,
                    'quantity' => $qty,
                ],
            ]);
---
INSERT INTO `cart_product` (`cart_id`, `price`, `product_id`, `product_variation_id`, `quantity`, `real_price`) VALUES (1, 700, 15, 44, 1, 700)

    public function storeGrouped(Request $request)
    {
        $request->validate([
            'products' => 'required|array',
        ]);

        $productsFromDB = Product::with('discount')->whereIn('id', request('products'))->get();

        $cart = (new \App\Support\Cart)->getOrCreateCart();

        $qty = request('quantity', 1);

        foreach ($productsFromDB as $product) {
            if ($product->stock_status == ProductStockStatus::OUT_OF_STOCK) {
                return back()->with('error', __('cart.specific_item_out_of_stock', ['product' => $product->name]));
            }

            if ($product->price < 1) {
                return back()->with('error', __('cart.specific_item_price_invalid', ['product' => $product->name]));
            }

            $query = $cart->products()->wherePivot('product_id', $product->id);

            $existing = $query->first();
---
SELECT * FROM `products` WHERE `id` in (120, 43) and `products`.`deleted_at` IS NULL
SELECT `products`.*, `cart_product`.`cart_id` as `pivot_cart_id`, `cart_product`.`product_id` as `pivot_product_id`, `cart_product`.`id` as `pivot_id`, `cart_product`.`product_variation_id` as `pivot_product_variation_id`, `cart_product`.`price` as `pivot_price`, `cart_product`.`real_price` as `pivot_real_price`, `cart_product`.`quantity` as `pivot_quantity` FROM `products` inner join `cart_product` on `products`.`id` = `cart_product`.`product_id` WHERE `cart_product`.`cart_id` = 1 and `cart_product`.`product_id` IS NULL and `products`.`deleted_at` IS NULL LIMIT 1
SELECT `products`.*, `cart_product`.`cart_id` as `pivot_cart_id`, `cart_product`.`product_id` as `pivot_product_id`, `cart_product`.`id` as `pivot_id`, `cart_product`.`product_variation_id` as `pivot_product_variation_id`, `cart_product`.`price` as `pivot_price`, `cart_product`.`real_price` as `pivot_real_price`, `cart_product`.`quantity` as `pivot_quantity` FROM `products` inner join `cart_product` on `products`.`id` = `cart_product`.`product_id` WHERE `cart_product`.`cart_id` = 1 and `cart_product`.`product_id` = 43 and `products`.`deleted_at` IS NULL LIMIT 1

                    ])
                );
            } else {
                $cart->products()->attach([
                    $product->id => [
                        'product_variation_id' => null,
                        'price' => $product->discount?->price ?? $product->price,
                        'real_price' => $product->price,
                        'quantity' => $qty,
                    ],
                ]);
---
INSERT INTO `cart_product` (`cart_id`, `price`, `product_id`, `product_variation_id`, `quantity`, `real_price`) VALUES (1, 600, 43, , 1, 600)

    public function remove(Request $request)
    {
        $request->validate([
            'product_id' => 'required|integer',
            'variation_id' => 'nullable|integer',
        ]);

        $cart = (new \App\Support\Cart)->getOrCreateCart();

        if ($request->has('variation_id')) {
            $cart->products()
                ->wherePivot('product_id', request('product_id'))
                ->wherePivot('product_variation_id', request('variation_id'))
                ->detach();
---
DELETE FROM `cart_product` WHERE `product_id` = 23 and `product_variation_id` IS NULL and `cart_product`.`cart_id` = 1

    public function updateQuantity(Request $request)
    {
        $request->validate([
            'product_id' => 'required|integer',
            'variation_id' => 'nullable|integer',
            'quantity' => 'required|integer|min:1',
        ]);

        $cart = (new \App\Support\Cart)->getOrCreateCart();

        $product = $cart->products()->wherePivot('product_id', request('product_id'));

        if (request('variation_id')) {
            $product->wherePivot('product_variation_id', request('variation_id'));
        }

        $existing = $product->first();
---
SELECT `products`.*, `cart_product`.`cart_id` as `pivot_cart_id`, `cart_product`.`product_id` as `pivot_product_id`, `cart_product`.`id` as `pivot_id`, `cart_product`.`product_variation_id` as `pivot_product_variation_id`, `cart_product`.`price` as `pivot_price`, `cart_product`.`real_price` as `pivot_real_price`, `cart_product`.`quantity` as `pivot_quantity` FROM `products` inner join `cart_product` on `products`.`id` = `cart_product`.`product_id` WHERE `cart_product`.`cart_id` = 1 and `cart_product`.`product_id` = 52 and `cart_product`.`product_variation_id` = 155 and `products`.`deleted_at` IS NULL LIMIT 1