app/Http/Controllers/CartController.php

DELETE FROM `cart_product` WHERE `product_id` = 112 and `product_variation_id` IS NULL and `cart_product`.`cart_id` = 1
---
    public function remove(Request $request)
    {
        $request->validate([
            'product_id' => 'required|integer',
            'variation_id' => 'nullable|integer',
        ]);

        $cart = (new \App\Support\Cart)->getOrCreateCart();

        if ($request->has('variation_id')) {
            $cart->products()
                ->wherePivot('product_id', request('product_id'))
                ->wherePivot('product_variation_id', request('variation_id'))
                ->detach();
        } else {
            $cart->products()
                ->wherePivot('product_id', request('product_id'))
                ->detach();