app/Http/Controllers/CategoryController.php

    public function show($slug): \Inertia\Response|\Inertia\ResponseFactory
    {
        //        dd(Product::all()->toArray());

        $category = CategoryData::from(Category::where('slug', $slug)->firstOrFail());

        $promotionProduct = ProductData::from(Product::with('cover')->active()->inRandomOrder()->first());

        $selectedAttributesValues = request('attributes') ?? [];
        $selectedVariationValues = request('variations') ?? [];

        $products = ProductData::collect(
            Product::with(['variations', 'discount', 'cover', 'categories'])
                ->active()
                ->whereHas('categories', fn ($query) => $query->where('categories.id', $category->id))
                ->when($selectedAttributesValues && count($selectedAttributesValues) > 0, function ($query) use ($selectedAttributesValues) {
                    foreach ($selectedAttributesValues as $attribute => $value) {
                        if (! empty($value)) {
                            $query->whereHas('attributes', function ($q) use ($value) {
                                $q->whereIn('attribute_values.id', (array) $value);
                            });
                        }
                    }
                })
                ->when($selectedVariationValues && count($selectedVariationValues) > 0, function ($query) use ($selectedVariationValues) {
                    foreach ($selectedVariationValues as $variationId => $variationValue) {
                        if (! empty($variationValue)) {
                            $query->whereHas('variations', function ($q) use ($variationValue) {
                                $q->whereHas('variations', function ($q2) use ($variationValue) {
                                    $q2->whereIn('variation_values.id', (array) $variationValue);
                                });
                            });
                        }
                    }
                })
                ->when(request()->filled('priceRange') && count(request('priceRange')) === 2, function ($query) {
                    $query->whereHas('variations', function ($q) {
                        $priceRange = request('priceRange');
                        $q->where('price', '>=', $priceRange[0] * 100)
                            ->where('price', '<=', $priceRange[1] * 100);
                    });

                })
                ->paginate(12)
        );

        $variations = VariationData::collect(Variation::with('values')->get());
        $attributes = AttributeData::collect(Attribute::with('values')->get());
---
SELECT * FROM `attribute_values` WHERE `attribute_values`.`attribute_id` in (1, 2, 3, 4, 5)
SELECT * FROM `variation_values` WHERE `variation_values`.`variation_id` in (1)
SELECT * FROM `variations`
SELECT * FROM `attributes`