app/Http/Controllers/HomeController.php

    public function __invoke(GeneralSettings $settings, PromotionSettings $promotion_settings)
    {
        $actionProducts = $promotion_settings->action_products;
        $promotedProducts = $promotion_settings->promoted_products;
        $promotedSets = $promotion_settings->promoted_product_sets;

        $popularProducts = ProductData::collect(Product::query()
            ->with('variations.discount', 'discount', 'cover', 'categories')
            ->with([
                'variations' => function ($query) {
                    $query->with('variations')
                        ->select('product_variations.*');
                },
            ])
            ->active()
            ->orderByDiscount()
            ->when(! empty($actionProducts), fn ($q) => $q->orderByRaw('FIELD(id, '.implode(',', $actionProducts).') DESC'))
            ->when(empty($actionProducts), fn ($q) => $q->inRandomOrder())
            ->limit(8)
            ->get());

        $staffRecommendedProducts = ProductData::collect(Product::query()
            ->with('variations.discount', 'discount', 'cover', 'categories')
            ->with([
                'variations' => function ($query) {
                    $query->with('variations')
                        ->select('product_variations.*');
                },
            ])
            ->active()
            ->when(! empty($promotedProducts), fn ($q) => $q->orderByRaw('FIELD(id, '.implode(',', $promotedProducts).') DESC'))
            ->when(empty($promotedProducts), fn ($q) => $q->inRandomOrder())
            ->limit(8)
            ->get());

        $teaSets = ProductData::collect(Product::query()
            ->with('variations.discount', 'discount', 'cover', 'categories')
            ->with([
                'variations' => function ($query) {
                    $query->with('variations')
                        ->select('product_variations.*');
                },
            ])
            ->where('product_type_id', 2)
            ->active()
            ->when(! empty($promotedSets), fn ($q) => $q->orderByRaw('FIELD(id, '.implode(',', $promotedSets).') DESC'))
            ->when(empty($promotedSets), fn ($q) => $q->inRandomOrder())
            ->limit(4)
            ->get());

        $teaOfTheMonth = [
            'title' => $promotion_settings->tea_of_the_month_title['sr'] ?? '',
            'subtitle' => $promotion_settings->tea_of_the_month_subtitle['sr'] ?? '',
            'image' => ! empty($promotion_settings->tea_of_the_month_image) ? Storage::disk(Disk::Attachments)->url($promotion_settings->tea_of_the_month_image[0]) : asset('site/images/hero_art.webp'),
            'product' => ProductData::from(Product::with('variations.discount', 'discount', 'cover', 'categories')
                ->with([
                    'variations' => function ($query) {
                        $query->with('variations')
                            ->select('product_variations.*');
                    },
                ])
                ->active()
                ->when(! empty($promotion_settings->tea_of_the_month_products),
                    fn ($q) => $q->whereIn('id', $promotion_settings->tea_of_the_month_products))
                ->inRandomOrder()
                ->first()),
        ];
        $specialOffer = [
            'title' => $promotion_settings->special_offer_title['sr'] ?? '',
            'subtitle' => $promotion_settings->special_offer_subtitle['sr'] ?? '',
            'image' => ! empty($promotion_settings->special_offer_bg_image) ? Storage::disk(Disk::Attachments)->url($promotion_settings->special_offer_bg_image[0]) : asset('site/images/hero_art.webp'),
            'product' => ProductData::from(Product::with('variations.discount', 'discount', 'cover', 'categories')
                ->with([
                    'variations' => function ($query) {
                        $query->with('variations')
                            ->select('product_variations.*');
                    },
                ])
                ->active()
                ->when(! empty($promotion_settings->special_offer_products),
                    fn ($q) => $q->whereIn('id', $promotion_settings->special_offer_products))
                ->inRandomOrder()
                ->first()),
        ];
---
SELECT * FROM `discounts` WHERE `discounts`.`product_variation_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 25, 26, 27, 151, 152, 153, 253, 254, 255, 292, 293, 294)
SELECT * FROM `products` WHERE `products`.`id` in (1, 2, 3, 4, 9, 51, 87, 106) and `products`.`deleted_at` IS NULL
SELECT * FROM `variations` WHERE `variations`.`id` in (1)
SELECT `product_variations`.* FROM `product_variations` WHERE `product_variations`.`product_id` in (8, 17, 18, 48, 62, 84, 130, 146)
SELECT * FROM `discounts` WHERE `discounts`.`product_variation_id` in (25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48)
SELECT * FROM `products` WHERE `products`.`id` in (9, 10, 11, 12, 13, 14, 15, 16) and `products`.`deleted_at` IS NULL
SELECT `product_variations`.* FROM `product_variations` WHERE `product_variations`.`product_id` in (24, 41, 67, 100, 117, 129, 133, 135)
SELECT * FROM `discounts` WHERE `discounts`.`product_variation_id` in (7, 8, 9, 10, 11, 12)
SELECT * FROM `products` WHERE `products`.`id` in (3, 4) and `products`.`deleted_at` IS NULL
SELECT `product_variations`.* FROM `product_variations` WHERE `product_variations`.`product_id` in (111, 139, 142, 146)
SELECT * FROM `discounts` WHERE `discounts`.`product_variation_id` in (148, 149, 150)
SELECT * FROM `products` WHERE `products`.`id` in (50) and `products`.`deleted_at` IS NULL
SELECT `product_variations`.* FROM `product_variations` WHERE `product_variations`.`product_id` in (103)
SELECT * FROM `discounts` WHERE `discounts`.`product_variation_id` in (1, 2, 3, 4, 5, 6)
SELECT * FROM `products` WHERE `products`.`id` in (1, 2) and `products`.`deleted_at` IS NULL
SELECT `product_variations`.* FROM `product_variations` WHERE `product_variations`.`product_id` in (146)
SELECT * FROM `discounts` WHERE `discounts`.`product_variation_id` in (73, 74, 75)
SELECT * FROM `products` WHERE `products`.`id` in (25) and `products`.`deleted_at` IS NULL
SELECT `product_variations`.* FROM `product_variations` WHERE `product_variations`.`product_id` in (25)
SELECT `product_variations`.* FROM `product_variations` WHERE `product_variations`.`product_id` in (44)

            ->take(3)
            ->get());

        $matchRituals = ProductData::collect(Product::query()
            ->with('variations.discount', 'discount', 'cover', 'categories')
            ->active()
            ->limit(2)
            ->get());

        $mateRituals = ProductData::collect(Product::query()
            ->with('variations.discount', 'discount', 'cover', 'categories')
            ->active()
            ->skip(2)
            ->limit(2)
            ->get());
---
SELECT * FROM `products` WHERE `products`.`id` in (1, 2) and `products`.`deleted_at` IS NULL
SELECT * FROM `variations` WHERE `variations`.`id` in (1)
SELECT * FROM `products` WHERE `products`.`id` in (3, 4) and `products`.`deleted_at` IS NULL