app/Http/Controllers/OrderController.php

SELECT * FROM `addresses` WHERE `addresses`.`id` in (1)
SELECT * FROM `orders` WHERE `uuid` = '9e07a958-97ad-4a08-bc63-ff13ffbd4d53' LIMIT 1
SELECT * FROM `products` WHERE `products`.`id` in (54, 90, 141) and `products`.`deleted_at` IS NULL
SELECT * FROM `users` WHERE `users`.`id` in (2)
---
    public function summary($uuid): \Inertia\Response|\Inertia\ResponseFactory
    {
        $order = Order::where('uuid', $uuid)->with('items.product.cover', 'user', 'shippingAddress')->firstOrFail();