app/Http/Controllers/PageController.php

    public function show()
    {
        $page = Page::where('slug', collect(request()->all())->keys()->first())->where('status', PageStatus::ACTIVE)->firstOrFail();
---
SELECT * FROM `pages` WHERE `slug` = 'cajevi' and `status` = 1 and `pages`.`deleted_at` IS NULL LIMIT 1