app/Http/Controllers/ProductController.php

    public function show($slug)
    {
        $product = ProductData::from(Product::query()
            ->with(['variations.discount', 'photos', 'discount', 'cover', 'categories', 'productTags', 'attributes.attribute'])
            ->active()
            ->where('slug', $slug)
            ->firstOrFail()
        );

        $categoryIds = $product->categories?->pluck('id')->toArray();

        info(print_r($categoryIds, true));
        $similarProductsIds = $product->data['similar_products'] ?? null;

        $similarProducts = ProductData::collect(Product::query()
            ->when(! empty($similarProductsIds), function ($query) use ($similarProductsIds) {
                $query->whereIn('id', $similarProductsIds);
            })
            ->whereNot('id', $product->id)
            ->with(['variations.discount', 'discount', 'cover', 'categories'])
            ->with([
                'variations' => function ($query) {
                    $query->with('variations')
                        ->select('product_variations.*');
                },
            ])
            ->active()
            ->when(empty($similarProductsIds), function ($query) use ($categoryIds) {
                $query->whereHas('categories', function ($q) use ($categoryIds) {
                    if (count($categoryIds) > 1) {
                        $categoryIds = array_slice($categoryIds, -1, 1);
                    }
                    $q->whereIn('categories.id', $categoryIds);
                });
            })
            ->take(4)
            ->inRandomOrder()
            ->get()
        );
---
SELECT * FROM `attributes` WHERE `attributes`.`id` in (1, 2, 3, 4, 5)
SELECT * FROM `products` WHERE `products`.`id` in (3) and `products`.`deleted_at` IS NULL
SELECT * FROM `variations` WHERE `variations`.`id` in (1)
SELECT * FROM `discounts` WHERE `discounts`.`product_variation_id` in (46, 47, 48, 55, 56, 57, 58, 59, 60, 79, 80, 81)
SELECT * FROM `products` WHERE `products`.`id` in (16, 19, 20, 27) and `products`.`deleted_at` IS NULL
SELECT `product_variations`.* FROM `product_variations` WHERE `product_variations`.`product_id` in (16, 19, 20, 27)

    public function search()
    {
        $query = request('query');

        $products = Product::where('name', 'like', '%'.$query.'%')
            ->active()
            ->with('cover', 'discount')
            ->take(10)
            ->get();
---
SELECT * FROM `products` WHERE `name` like '%to%' and `products`.`deleted_at` IS NULL LIMIT 10