app/Http/Controllers/ProductController.php

    public function search()
    {
        $query = request('query');

        $products = Product::where('name', 'like', '%'.$query.'%')
            ->with('cover')
            ->take(20)
            ->get();

        return response()->json(ProductData::collect($products));
---
SELECT * FROM `products` WHERE `name` like '%to%' and `products`.`deleted_at` IS NULL LIMIT 10

                ->paginate(30)
        );

        $variations = VariationData::collect(Variation::with('values')->get());
        $attributes = AttributeData::collect(Attribute::with('values')->get());
---
SELECT * FROM `variations`
SELECT * FROM `attributes`