app/Http/Controllers/SearchController.php

    public function search(): \Inertia\Response|\Inertia\ResponseFactory
    {
        $selectedAttributesValues = request('attributes') ?? [];
        $selectedVariationValues = request('variations') ?? [];
        $contains = request('contains') ?? [];

        $selectedTypes = request('selectedTypes') ?? [];
        if (! empty(request('type'))) {
            $types = [request('type')];
            if (request('type') === 'dodaci') {
                $types = ['pribor', 'med'];
            }
            $types = ProductType::whereIn('slug', $types)->pluck('id')->toArray();
---
SELECT `id` FROM `product_types` WHERE `slug` in ('cajevi')

                        }
                    }
                })
                ->when($selectedVariationValues && count($selectedVariationValues) > 0, function ($query) use ($selectedVariationValues) {
                    foreach ($selectedVariationValues as $variationId => $variationValue) {
                        if (! empty($variationValue)) {
                            $query->whereHas('variations', function ($q) use ($variationValue) {
                                $q->whereHas('variations', function ($q2) use ($variationValue) {
                                    $q2->whereIn('variation_values.id', (array) $variationValue);
                                });
                            });
                        }
                    }
                })
                ->when(request()->filled('priceRange') && count(request('priceRange')) === 2, function ($query) {
                    $priceRange = request('priceRange');
                    $query->whereBetween('base_price', [$priceRange[0] * 100, $priceRange[1] * 100]);
                })
                ->when(request('search') ?? null, function ($query, $search) {
                    $query->where('name', 'like', "%$search%");
                })
                ->when(! empty($selectedCategories), function ($query) use ($selectedCategories) {
                    $query->whereHas('categories', fn ($q) => $q->whereIn('categories.id', $selectedCategories));
                })
                ->orderByDiscount()
                ->paginate(16)
        );

        $variations = VariationData::collect(Variation::where('searchable', VariationSearchable::YES)->with('values')->get());
        $attributes = AttributeData::collect(Attribute::where('searchable', AttributeSearchable::YES)->where('type', AttributeType::SELECT)->with('values')->get());
        $radioAttributes = AttributeData::collect(Attribute::where('searchable', AttributeSearchable::YES)->where('type', AttributeType::RADIO)
            ->with([
                'values' => function ($query) {
                    $query->where('value->sr', 'Nema');
                },
            ])
            ->get());
---
SELECT * FROM `variations` WHERE `variations`.`id` in (1)
SELECT * FROM `variations` WHERE `searchable` = 1
SELECT * FROM `attributes` WHERE `searchable` = 1 and `type` = 1
SELECT * FROM `attributes` WHERE `searchable` = 1 and `type` = 3

            $description = 'Opremite se za uživanje u čaju uz naš pribor i med. Pronađite savršen poklon za sebe ili nekog koga volite.';
        }

        return inertia('product/search', [
            'pageData' => [
                'title' => $title,
                'description' => $description,
                'slug' => request('category') ?? request('slug') ?? '',
            ],
            'products' => $products,
            'variations' => $variations,
            'attributes' => $attributes,
            'radioAttributes' => $radioAttributes,
            'types' => ProductTypeData::collect(ProductType::get()),
            'query' => [
                'selectedTypes' => $selectedTypes ?? [],
                'attributes' => $attributes->mapWithKeys(fn ($attribute) => [
                    $attribute->slug => request('attributes')[$attribute->slug] ?? null,
                ]),
                'contains' => $radioAttributes->mapWithKeys(fn ($attribute) => [
                    $attribute->slug => request('contains')[$attribute->slug] ?? null,
                ]),
                'variations' => $variations->mapWithKeys(fn ($variation) => [
                    $variation->id => request('variations')[$variation->id] ?? null,
                ]),
                'priceRange' => request('priceRange'),
---
SELECT * FROM `product_types`