app/Http/Controllers/SearchController.php

                        }
                    }
                })
                ->when($selectedVariationValues && count($selectedVariationValues) > 0, function ($query) use ($selectedVariationValues) {
                    foreach ($selectedVariationValues as $variationId => $variationValue) {
                        if (! empty($variationValue)) {
                            $query->whereHas('variations', function ($q) use ($variationValue) {
                                $q->whereHas('variations', function ($q2) use ($variationValue) {
                                    $q2->whereIn('variation_values.id', (array) $variationValue);
                                });
                            });
                        }
                    }
                })
                ->when(request()->filled('priceRange') && count(request('priceRange')) === 2, function ($query) {
                    $priceRange = request('priceRange');
                    $query->whereBetween('base_price', [$priceRange[0] * 100, $priceRange[1] * 100]);
                })
                ->when(request('search') ?? null, function ($query, $search) {
                    $query->where('name', 'like', "%$search%");
                })
                ->when(! empty($selectedCategories), function ($query) use ($selectedCategories) {
                    $query->whereHas('categories', fn ($q) => $q->whereIn('categories.id', $selectedCategories));
                })
                ->orderByDiscount()
                ->orderBy('order_column')
                ->when((request('custom') === 'na-akciji'), fn ($query) => $query->has('discount'))
                ->when((request('type') === 'promocije'), function ($query) {
                    return $query->where(function ($q) {
                        $q->has('discount')->orWhere(function ($q2) {
                            $q2->withAnyTags(['novo-u-ponudi', 'kratkotrajna-ponuda'], 'product');
                        });
                    });
                })
                ->paginate(16)
        );
---
SELECT * FROM `products` WHERE `products`.`id` in (70, 71, 72, 73) and `products`.`deleted_at` IS NULL