app/Filament/Resources/ProductResource.php

SELECT * FROM `attributes`
---
                ])->columnSpan(['lg' => 1]),

                Forms\Components\Section::make('Attributes')->columns(2)->schema(function () {
                    $attributes = Attribute::with('values')->get();