app/Support/Cart.php

    public function getCart()
    {
        return \App\Models\Cart::with('products.discount', 'products.variations.discount')
            ->where('status', CartStatus::ACTIVE)
            ->where('session', $this->cartSession())
            ->first();
---
SELECT * FROM `variations` WHERE `variations`.`id` in (1)
SELECT `products`.*, `cart_product`.`cart_id` as `pivot_cart_id`, `cart_product`.`product_id` as `pivot_product_id`, `cart_product`.`id` as `pivot_id`, `cart_product`.`product_variation_id` as `pivot_product_variation_id`, `cart_product`.`price` as `pivot_price`, `cart_product`.`real_price` as `pivot_real_price`, `cart_product`.`quantity` as `pivot_quantity` FROM `products` inner join `cart_product` on `products`.`id` = `cart_product`.`product_id` WHERE `cart_product`.`cart_id` in (1) and `products`.`deleted_at` IS NULL

    public function getOrCreateCart()
    {
        return \App\Models\Cart::query()
            ->with('products')
            ->where('status', CartStatus::ACTIVE)
            ->firstOrCreate([
                'session' => $this->cartSession(),
            ]);
---
SELECT `products`.*, `cart_product`.`cart_id` as `pivot_cart_id`, `cart_product`.`product_id` as `pivot_product_id`, `cart_product`.`id` as `pivot_id`, `cart_product`.`product_variation_id` as `pivot_product_variation_id`, `cart_product`.`price` as `pivot_price`, `cart_product`.`real_price` as `pivot_real_price`, `cart_product`.`quantity` as `pivot_quantity` FROM `products` inner join `cart_product` on `products`.`id` = `cart_product`.`product_id` WHERE `cart_product`.`cart_id` in (1) and `products`.`deleted_at` IS NULL