app/Support/Product.php

SELECT * FROM `discounts` WHERE `discounts`.`product_variation_id` in (10, 11, 12, 19, 20, 21, 76, 77, 78, 127, 128, 129)
SELECT * FROM `products` WHERE `products`.`id` in (4, 7, 26, 43) and `products`.`deleted_at` IS NULL
SELECT * FROM `variations` WHERE `variations`.`id` in (1)
SELECT `product_variations`.* FROM `product_variations` WHERE `product_variations`.`product_id` in (4, 7, 26, 43)
---
    public function transformProductPackagesArray(array $promoPackages): array
    {
        // app|todo maybe should be cached.
        $productIds = collect($promoPackages)
            ->pluck('products')
            ->flatten()
            ->unique()
            ->filter()
            ->all();

        $products = ProductData::collect(\App\Models\Product::query()
            ->with('variations.discount', 'discount', 'cover', 'categories')
            ->with([
                'variations' => function ($query) {
                    $query->with('variations')
                        ->select('product_variations.*');
                },
            ])
            ->whereIn('id', $productIds)
            ->get()
            ->keyBy('id'));

        return collect($promoPackages)->map(function ($package) use ($products) {
            $package['products'] = collect($package['products'])
                ->map(fn ($id) => $products->get($id))
                ->filter()
                ->all();